---
kind: property
id: P:Autodesk.Revit.DB.PanelTypeSet.Size
source: html/dcf1048d-dcf4-99cd-d6de-0a34bf70c065.htm
---
# Autodesk.Revit.DB.PanelTypeSet.Size Property

Returns the number of panel types that are in the set.

## Syntax (C#)
```csharp
public virtual int Size { get; }
```